# num = int(input('Санды киргизиңиз: '))
# num_1 = int(input('Санды киргизиңиз: '))

# sum = num +num_1
# raznost = num - num_1
# proizvedenie = num * num_1

# print(sum)
# print(raznost)
# print(proizvedenie)

# product = input('Продуктаны киргизиңиз: ')
# product_1 = product.split(',')
# print(product_1)

# city = input('Өлкөнүн атын киргизиңиз: ')

# аба_ырайы = "булуттуу" # Келгиле, аба ырайы "булуттуу" дейли

# if аба_ырайы == "жамгыр": # Биринчи шарт: жамгырбы? (Жок)
#     print("Кол чатыр ал!")
# elif аба_ырайы == "күн ачык": # Экинчи шарт: күн ачыкпы? (Жок)
#     print("Көз айнек тагын!")
# else: # Эч кайсы шарт туура келбеди, ошондуктан ушул аткарылат
#     print("Куртка кийип чыга бер.")

окуучунун_баасы = 75 # Мисал үчүн окуучу 75 балл алды дейли

# Эми шарттарды текшеребиз:
if окуучунун_баасы >= 90: # Биринчи шарт: Баа 90дон жогору же барабарбы?
    print("Азамат! Эң жакшы баа!")
elif окуучунун_баасы >= 70: # Экинчи шарт: Баа 70тен жогору же барабарбы?
    print("Жакшы! Бирок мындан да жакшы боло аласың.")
elif окуучунун_баасы >= 50: # Үчүнчү шарт: Баа 50дөн жогору же барабарбы?
    print("Канааттандырарлык. Дагы аракет кылыш керек.")
else: # Башка бардык учурларда (эгер баа 50дөн төмөн болсо):
    print("Начар. Кийинки жолу көбүрөөк аракет кыл.")