
# киргизилген_аттар = input("Окуучулардын аттарын үтүр (,) менен бөлүп жазыңыз: ")

# if киргизилген_аттар.strip(): # .strip() башындагы жана аягындагы боштуктарды алып салат
#     окуучулар_тизмеси = [ат.strip() for ат in киргизилген_аттар.split(',')]
# else:
#     окуучулар_тизмеси = []

# # 3. Түзүлгөн окуучулар тизмесин жана алардын санын чыгарабыз
# print(f"\nОкуучулардын тизмеси: {окуучулар_тизмеси}")

# окуучулардын_саны = len(окуучулар_тизмеси)
# print(f"Жалпы окуучулардын саны: {окуучулардын_саны}")

# # 4. Окуучулардын саны 5тен көп экенин текшеребиз
# if окуучулардын_саны > 5:
#     print("Жыйынтык: Класста 5 окуучудан көп.")
# elif окуучулардын_саны == 5:
#     print("Жыйынтык: Класста так 5 окуучу бар.")
# else: # Демек, окуучулардын_саны < 5
#     print("Жыйынтык: Класста 5 окуучудан аз (же окуучу жок).








# name = Techperson
# middle_count = len(name)
# print(name[0:1]) 
# print(name[-1]) 

# user_input = input("Текст киргизиңиз: ")
# def count_letters(text):
#   letter_count = 0
#   for char in text:
#     if char.isalpha():  
#       letter_count += 1
#   return letter_count

# num_letters = count_letters(user_input)
# print(f"'{user_input}' текстинде {num_letters} тамга бар.")

x = input('Текст киргиз:')
if len(x)>5:
  print(x[0],len(x)-2,x[-1])
else:
  print(x)